app/controllers/places_controller.rb

  def getPlaces

           @radius = 2
           @location = params['location']
           api_key = "8pvw4ckh94ekte6a7gfs3wn8"
           query = "starbucks"

           url = URI.parse('http://api2.citysearch.com')
           res = Net::HTTP.start(url.host, url.port) {|http|
                http.get("/search/locations?what=#{query}&where=#{@location}&radius=#{@radius}&publisher=geocade&api_key=#{api_key}&rpp=50&format=json")
               }

           json_resp = res.body
           @places = JSON.parse(json_resp)

           @count =  @places['jsonResponse']['totalhits']
           @caffeination_level = @count.div(@radius)

           place = Place.new
              place.location = @location
              place.count = @count
              place.caffeination_level = @caffeination_level
            place.save
---
INSERT INTO "places" ("location", "created_at", "updated_at", "caffeination_level", "count") VALUES('winthrop,ma', '2010-08-15 19:00:40', '2010-08-15 19:00:40', 1, 2)

  def index
    @places = Place.all
---
SELECT * FROM "places"